#과일 리스트 [5개 이상]를 만들어서, 원하는 과일을 선택한 후,
#~~과일은 정말 맛있죠!

# 2. 점메추 리스트
# 점심메뉴 리스트, 후식메뉴 리스트, 음료메뉴 리스트
# ex) 점심 메뉴를 고르세요(1~5번 선택)
# 모두 고르면
# 점메추: {점심}, {후식}, {음료} 맛있게 드셈

# 3. CGV 프로그램
# 이름, 멤버 리스트[일반/브론즈/실버/골드] 영화 리스트[5개], 간식 리스트[5개]
#...고르면
#CGV: {멤버 리스트} {이름}회원님, {영화}fmf {간식}과 함께 즐거운 관람 되십시오!


#1. 과일 리스트

fruits = ['🍈', '🥝', '🍇', '🍎', '🍓']
print(fruits[2])
print(f"{fruits}")
pick = int(input("원하는 과일을 골라주세요(0~4번"))
print(f"{fruits[pick]}가 꿀맛이죠")

# 동물 리스트
animal = ['호랑이', '강아지', '고양이', '기린', '코끼리']
print(f"{animal}")
pick = int(input("내가 좋아하는 동물을 골라주세요(0~4번)"))
print(f"{animal[pick]}가 핵귀죠")




#점메추 리스트

#menu = ['우동', '김밥', '파스타', '칼국수', '솥밥')
#a = input(menu[])
# print(f)
